# AssemblyMemberDifferentGeometry Methods (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
AssemblyMemberDifferentGeometry Methods
AssemblyMemberDifferentGeometry Class See Also
---
The AssemblyMemberDifferentGeometry type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Dispose | (Inherited from AssemblyMemberDifference.) |
| Equals | Determines whether the specified Object is equal to the current Object. (Inherited from Object.) |
| GetHashCode | Serves as a hash function for a particular type.  (Inherited from Object.) |
| GetType | Gets the Type of the current instance. (Inherited from Object.) |
| ToString | Returns a string that represents the current object. (Inherited from Object.) |

# See Also
AssemblyMemberDifferentGeometry Class
Autodesk.Revit.DB Namespace